# --------------------------------------------  1   -------------------------------------------------------------------
ls = [1,2,True]
print(ls)
print((1,12,1))
print({12,23,12})
num = int(input("Введите число: "))
print("Ваше число", num)

str = input("Как вас зовут? ")
print("Привет", str)

numeric = float(input("Введите число с плавающей точкой: "))
print(numeric)

#--------------------------------------------  2   ---------------------------------------------------------------------

all_second = int(input("Введите количество секунд: "))
all_minuts = all_second // 60
hour = all_minuts // 60
minuts = all_minuts - (hour*60)
second = all_second-(all_minuts * 60)
print(f"{hour:02}:{minuts:02}:{second:02}")

#========================================= 3 ==================================================
num = int(input("Введите число: "))
print(f"{num} + {num}{num} + {num}{num}{num} = " + "{0}".format(int(f"{num}") + int(f"{num}{num}") + int(f"{num}{num}{num}")))

#========================================= 4 ==================================================
num = input("Введите целое положительное число: ")
i = 0
maxnum = 0
while i < len(num):
    if int(num[i]) > maxnum:
        maxnum = int(num[i])
    i += 1
print(f"Максимальное число = {maxnum}")
#=========================================  5   =================================================

profit = float(input("Введите сумму выручки фирмы: "))
costs = float(input("Введите сумму издержек фирмы: "))
if profit >= costs:
    print("Прибыль по фирме составляет {0}".format(profit - costs))
    print("Рентабельность = {0:0.2f}".format(profit/costs))
    count_employees = int(input("Введите число сотрудников в фирме: "))
    print("Прибыль фирмы в расчете на одного сотрудника = {0:0.2f}".format(profit / count_employees))
elif profit < costs:
    print("Убыток по компании составляет {0}".format(costs - profit))

#========================================== 6 ==================================================

a = float(input("Введите растояние начального результат пробежки: "))
b = float(input("Введите запланированое растояние пробежки: "))
i = 1
while True:
    if i == 1:
        print(f"{i} -й день: {a}")
    else:
        print(f"{i} -й день: " + "{0:0.3f}".format(a * 1.1))
        a = a * 1.1
    if a * 1.1 >= b:
        print(f"{i+1} -й день: " + "{0:0.3f}".format(a * 1.1))
        break
    i += 1
